---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegralWarn
source: html/47a98991-48a5-f6f7-d199-0c1c6e312626.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealIntegralWarn Property

Could not create integral reveal for wall instance. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRevealIntegralWarn { get; }
```